Revit 2026 API

# SolidGlassSolidglassBumpAmount Property

---

The property labeled "Amount" from the "SolidGlass" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SolidglassBumpAmount { get; }
```
```vb
Public Shared ReadOnly Property SolidglassBumpAmount As String
	Get
```
```cpp
public:
static property String^ SolidglassBumpAmount {
	String^ get ();
}
```
```fsharp
static member SolidglassBumpAmount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 2".

#### Reference

SolidGlass Class

Autodesk.Revit.DB.Visual Namespace